{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report linking a homepage layout change to HomePage.tsx with metadata.",
  "frontend-file-summaries.txt": "Collection of short summaries for all frontend source files.",
  "frontend/index.css": "Tailwind base styles plus CSS variables for light and dark themes.",
  "frontend/index.html": "Basic HTML wrapper mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and authentication gating via AppShell.",
  "frontend/src/components/explore/CategoryChips.tsx": "Renders clickable category filter chips using UI state selection.",
  "frontend/src/components/explore/ExploreGrid.tsx": "Displays a responsive grid of explore tiles with hover overlays and like counts.",
  "frontend/src/components/feed/PostCard.tsx": "Post card UI with like, comment, share actions and a comments dialog.",
  "frontend/src/components/feed/StoriesRow.tsx": "Scrollable stories row with modal story viewer.",
  "frontend/src/components/layout/AppShell.tsx": "Authenticated layout wrapper combining sidebar, top bar, and content.",
  "frontend/src/components/layout/Sidebar.tsx": "Navigation sidebar with primary links and a scrollable community list.",
  "frontend/src/components/layout/TopBar.tsx": "Top navigation bar with search, notifications, messages, and user dropdown, using UI state and custom hooks.",
  "frontend/src/components/suggestions/SuggestedForYou.tsx": "Shows a list of suggested users with follow toggling and a link to view more.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useOnEscape.ts": "Runs a callback when the Escape key is pressed.",
  "frontend/src/hooks/useOutsideClick.ts": "Triggers a callback when a click occurs outside the referenced element.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future query hooks.",
  "frontend/src/index.css": "Tailwind setup defining CSS variables, themes, and global styles.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/mock/mockData.ts": "Defines mock user, post, community, story, and explore tile data for frontend usage.",
  "frontend/src/pages/CommunityPage.tsx": "Displays a community's details and recent posts based on route params using mock data.",
  "frontend/src/pages/CreatePage.tsx": "Image upload form allowing users to preview artwork and enter caption and tags before publishing or saving as draft.",
  "frontend/src/pages/ExplorePage.tsx": "Filters and displays explore tiles based on selected category and search query using mock data.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Email-based password reset flow with submit confirmation and navigation back to login.",
  "frontend/src/pages/HomePage.tsx": "Displays stories and posts filtered by search query along with suggested users.",
  "frontend/src/pages/LoginPage.tsx": "User login form with validation, mock authentication, and optional navigation to password reset.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile details with posts grid, saved tab, and profile editing entry point.",
  "frontend/src/pages/SignupPage.tsx": "Signup form with basic validation and mock authentication before redirecting home.",
  "frontend/src/state/storage.ts": "LocalStorage wrapper providing get, set, and remove methods with JSON handling and error safety.",
  "frontend/src/state/useMockAuth.ts": "Zustand store implementing a simple persistent mock authentication system with login and logout.",
  "frontend/src/state/useUiState.ts": "Zustand store managing followed users, liked posts, explore category, and search query with persistence using localStorage and Set merging.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, plugins, custom colors, radii, shadows, and animations with extended theme tokens.",
  "project_state.json": "Project metadata describing the Artlink frontend-only app, its features, architectural notes, and known issues."
}